TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO</title>
<!-- 2014-10-26 Sun 11:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Silas Bartel" />
</head>
<body>
<div id="content">
<h1 class="title">TODO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="todo TODO">TODO</span> Debian/Ubuntu gcc compatibility</a>
<ul>
<li><a href="#sec-1-1">1.1. Descripton:</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Error code Debian shared:</a></li>
<li><a href="#sec-1-1-2">1.1.2. Error code Ubuntu shared:</a></li>
<li><a href="#sec-1-1-3">1.1.3. Error code Ubuntu static:</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Editor:</a></li>
</ul>
</li>
<li><a href="#sec-2">2. <span class="todo TODO">TODO</span> Clean Dependencies</a>
<ul>
<li><a href="#sec-2-1">2.1. Description:</a></li>
<li><a href="#sec-2-2">2.2. Editor:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. <span class="todo TODO">TODO</span> Comment the Code</a>
<ul>
<li><a href="#sec-3-1">3.1. Description:</a></li>
<li><a href="#sec-3-2">3.2. Editor:</a></li>
</ul>
</li>
<li><a href="#sec-4">4. <span class="todo TODO">TODO</span> List all CMake Options in README</a>
<ul>
<li><a href="#sec-4-1">4.1. Description:</a></li>
<li><a href="#sec-4-2">4.2. Editor:</a></li>
</ul>
</li>
<li><a href="#sec-5">5. <span class="done DONE">DONE</span> Convert README and ToDo</a>
<ul>
<li><a href="#sec-5-1">5.1. Description:</a></li>
<li><a href="#sec-5-2">5.2. Editor:</a></li>
</ul>
</li>
<li><a href="#sec-6">6. <span class="todo TODO">TODO</span> Fix code warnings</a></li>
</ul>
</div>
</div>
<pre class="example">
 _____     ____
|_   _|__ |  _ \  ___
  | |/ _ \| | | |/ _ \
  | | (_) | |_| | (_) |
  |_|\___/|____/ \___/
</pre>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Debian/Ubuntu gcc compatibility</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Descripton:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Linking error with gcc(!) under Debian/Ubuntu. Maybe a bug in GCC? Are the compiler options correct?
Works with llvm under Debian!
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Error code Debian shared:</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-sh">../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::OFF`</span>
../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::BOLD`</span>
collect2: error: ld returned 1 exit status
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Error code Ubuntu shared:</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh">Linking CXX executable ../../bin/engine_test1
../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::OFF`</span>
../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::BOLD`</span>
collect2: ld gab 1 als Ende-Status zur&#252;ck
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Error code Ubuntu static:</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh">Linking CXX executable ../../bin/engine_test1
../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::OFF`</span>
../../lib/libengine.so.0.1: undefined reference to <span style="color: #fa8072;">`e_engine::eCMDColor::BOLD`</span>
collect2: ld gab 1 als Ende-Status zur&#252;ck
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Editor:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Free
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Clean Dependencies</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Description:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Maybe link some libraries static or provide shared objects of GLEW/Boost(?) and so on.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Editor:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Free
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Comment the Code</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Description:</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Lots of functions are not or too less commented.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Editor:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Free
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> List all CMake Options in README</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Description:</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Lots of CMake options are undocumented.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Editor:</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Silas
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="done DONE">DONE</span> Convert README and ToDo</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Description:</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Convert README and ToDo in a Markdown.
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Editor:</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Silas
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Fix code warnings</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sh">[init/basicClasses/iDisplayBasic.hpp:30]: (style) struct or union member <span style="color: #ffa07a;">'res::width'</span> is never used
[init/basicClasses/iDisplayBasic.hpp:31]: (style) struct or union member <span style="color: #ffa07a;">'res::height'</span> is never used
[init/basicClasses/iDisplayBasic.hpp:37]: (style) struct or union member <span style="color: #ffa07a;">'mode_basic::prefered'</span> is never used
[init/basicClasses/iDisplayBasic.hpp:39]: (style) struct or union member <span style="color: #ffa07a;">'mode_basic::width'</span> is never used
[init/basicClasses/iDisplayBasic.hpp:40]: (style) struct or union member <span style="color: #ffa07a;">'mode_basic::height'</span> is never used
[init/basicClasses/iDisplayBasic.hpp:41]: (style) struct or union member <span style="color: #ffa07a;">'mode_basic::rate'</span> is never used
[init/iEventInfo.hpp:26]: (style) struct or union member <span style="color: #ffa07a;">'iEventInfo::type'</span> is never used
[init/windows/iDisplays.cpp:85]: (style) The scope of the variable <span style="color: #ffa07a;">'lMinDiffToPref_D'</span> can be reduced
[init/windows/iDisplays.cpp:91]: (style) The scope of the variable <span style="color: #ffa07a;">'lRatePref_D'</span> can be reduced
[init/x11/RandR/iRandR_structs.hpp:105] -&gt; [init/x11/RandR/iRandR_structs.hpp:105]: (style) Same expression on both sides of <span style="color: #ffa07a;">'=='</span>.
[init/x11/RandR/iRandR_structs.hpp:29]: (style) struct or union member <span style="color: #ffa07a;">'_crtc::posX'</span> is never used
[init/x11/RandR/iRandR_structs.hpp:30]: (style) struct or union member <span style="color: #ffa07a;">'_crtc::posY'</span> is never used
[init/x11/RandR/iRandR_structs.hpp:54]: (style) struct or union member <span style="color: #ffa07a;">'_output::mm_width'</span> is never used
[init/x11/RandR/iRandR_structs.hpp:55]: (style) struct or union member <span style="color: #ffa07a;">'_output::mm_height'</span> is never used
[init/x11/RandR/iRandR_structs.hpp:61]: (style) struct or union member <span style="color: #ffa07a;">'_output::npreferred'</span> is never used
[init/x11/iContext.cpp:311]: (style) struct or union member <span style="color: #ffa07a;">'MwmHints::functions'</span> is never used
[init/x11/iContext.cpp:313]: (style) struct or union member <span style="color: #ffa07a;">'MwmHints::input_mode'</span> is never used
[init/x11/iContext.cpp:314]: (style) struct or union member <span style="color: #ffa07a;">'MwmHints::status'</span> is never used
[render/rNormalObject.cpp:19]: (warning) Member variable <span style="color: #ffa07a;">'rNormalObject::vNeedUpdateMatrix_B'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[render/shader/rShader_structs.hpp:14]: (style) struct or union member <span style="color: #ffa07a;">'atributeObject::index'</span> is never used
[utils/log/uLog.cpp:319]: (style) Unused variable: lErrorType_STR
[utils/log/uLog_resources.hpp:190]: (warning) Member variable <span style="color: #ffa07a;">'__DATA_RAW__::vBasicColor_C'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[utils/log/uLog_resources.hpp:190]: (warning) Member variable <span style="color: #ffa07a;">'__DATA_RAW__::vBold_B'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[utils/log/uLog_resources.hpp:207]: (warning) Member variable <span style="color: #ffa07a;">'__DATA_CONF__::vColumns_uI'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[utils/log/uLog.cpp:333]: (style) Exception should be caught by reference.
[utils/sha/uSHA_2_selftest.cpp:62]: (style) Unused variable: lResult_str
[utils/uConfig.cpp:42]: (warning) Member variable <span style="color: #ffa07a;">'__uConfig_FBA::FBA_DRAW_TO_WINDOW'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[utils/uConfig.cpp:42]: (warning) Member variable <span style="color: #ffa07a;">'__uConfig_FBA::FBA_ACCELERATION'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
[utils/uConfig.cpp:42]: (warning) Member variable <span style="color: #ffa07a;">'__uConfig_FBA::FBA_OGL_SUPPORTED'</span> is not initialized<span style="color: #20b2aa; font-weight: bold;"> in</span> the constructor.
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Silas Bartel</p>
<p class="date">Created: 2014-10-26 Sun 11:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
